ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157cxx_ca7.h
/***************  Bit definition for DDRCTRL_ADDRMAP9 register  ***************/
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Pos (0U)
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Msk (0xFU << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Pos) /*!< 0x0000000F */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2     DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Msk           /*!< Selects the HIF address bits used as row address bit 2. */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_0   (0x1U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Pos) /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_1   (0x2U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Pos) /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_2   (0x4U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Pos) /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_3   (0x8U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B2_Pos) /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Pos (8U)
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Msk (0xFU << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Pos) /*!< 0x00000F00 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3     DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Msk           /*!< Selects the HIF address bits used as row address bit 3. */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_0   (0x1U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Pos) /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_1   (0x2U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Pos) /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_2   (0x4U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Pos) /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_3   (0x8U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B3_Pos) /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Pos (16U)
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Msk (0xFU << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Pos) /*!< 0x000F0000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4     DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Msk           /*!< Selects the HIF address bits used as row address bit 4. */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_0   (0x1U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Pos) /*!< 0x00010000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_1   (0x2U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Pos) /*!< 0x00020000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_2   (0x4U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Pos) /*!< 0x00040000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_3   (0x8U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B4_Pos) /*!< 0x00080000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Pos (24U)
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Msk (0xFU << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Pos) /*!< 0x0F000000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5     DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Msk           /*!< Selects the HIF address bits used as row address bit 5. */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_0   (0x1U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Pos) /*!< 0x01000000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_1   (0x2U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Pos) /*!< 0x02000000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_2   (0x4U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Pos) /*!< 0x04000000 */
#define DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_3   (0x8U << DDRCTRL_ADDRMAP9_ADDRMAP_ROW_B5_Pos) /*!< 0x08000000 */

/**************  Bit definition for DDRCTRL_ADDRMAP10 register  ***************/
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Pos (0U)
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Msk (0xFU << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Pos) /*!< 0x0000000F */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6     DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Msk           /*!< Selects the HIF address bits used as row address bit 6. */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_0   (0x1U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Pos) /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_1   (0x2U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Pos) /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_2   (0x4U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Pos) /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_3   (0x8U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B6_Pos) /*!< 0x00000008 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Pos (8U)
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Msk (0xFU << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Pos) /*!< 0x00000F00 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7     DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Msk           /*!< Selects the HIF address bits used as row address bit 7. */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_0   (0x1U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Pos) /*!< 0x00000100 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_1   (0x2U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Pos) /*!< 0x00000200 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_2   (0x4U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Pos) /*!< 0x00000400 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_3   (0x8U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B7_Pos) /*!< 0x00000800 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Pos (16U)
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Msk (0xFU << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Pos) /*!< 0x000F0000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8     DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Msk           /*!< Selects the HIF address bits used as row address bit 8. */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_0   (0x1U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Pos) /*!< 0x00010000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_1   (0x2U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Pos) /*!< 0x00020000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_2   (0x4U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Pos) /*!< 0x00040000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_3   (0x8U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B8_Pos) /*!< 0x00080000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Pos (24U)
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Msk (0xFU << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Pos) /*!< 0x0F000000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9     DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Msk           /*!< Selects the HIF address bits used as row address bit 9. */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_0   (0x1U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Pos) /*!< 0x01000000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_1   (0x2U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Pos) /*!< 0x02000000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_2   (0x4U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Pos) /*!< 0x04000000 */
#define DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_3   (0x8U << DDRCTRL_ADDRMAP10_ADDRMAP_ROW_B9_Pos) /*!< 0x08000000 */

/**************  Bit definition for DDRCTRL_ADDRMAP11 register  ***************/
#define DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Pos (0U)
#define DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Msk (0xFU << DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Pos) /*!< 0x0000000F */
#define DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10     DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Msk           /*!< Selects the HIF address bits used as row address bit 10. */
#define DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_0   (0x1U << DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Pos) /*!< 0x00000001 */
#define DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_1   (0x2U << DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Pos) /*!< 0x00000002 */
#define DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_2   (0x4U << DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Pos) /*!< 0x00000004 */
#define DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_3   (0x8U << DDRCTRL_ADDRMAP11_ADDRMAP_ROW_B10_Pos) /*!< 0x00000008 */

/****************  Bit definition for DDRCTRL_ODTCFG register  ****************/
#define DDRCTRL_ODTCFG_RD_ODT_DELAY_Pos (2U)
#define DDRCTRL_ODTCFG_RD_ODT_DELAY_Msk (0x1FU << DDRCTRL_ODTCFG_RD_ODT_DELAY_Pos) /*!< 0x0000007C */
#define DDRCTRL_ODTCFG_RD_ODT_DELAY     DDRCTRL_ODTCFG_RD_ODT_DELAY_Msk            /*!< The delay, in DFI PHY clock cycles, from issuing a read command to setting ODT values associated with that command. ODT setting must remain constant for the entire time that DQS is driven by the DDRCTRL. */
#define DDRCTRL_ODTCFG_RD_ODT_DELAY_0   (0x1U << DDRCTRL_ODTCFG_RD_ODT_DELAY_Pos)  /*!< 0x00000004 */
#define DDRCTRL_ODTCFG_RD_ODT_DELAY_1   (0x2U << DDRCTRL_ODTCFG_RD_ODT_DELAY_Pos)  /*!< 0x00000008 */
#define DDRCTRL_ODTCFG_RD_ODT_DELAY_2   (0x4U << DDRCTRL_ODTCFG_RD_ODT_DELAY_Pos)  /*!< 0x00000010 */
#define DDRCTRL_ODTCFG_RD_ODT_DELAY_3   (0x8U << DDRCTRL_ODTCFG_RD_ODT_DELAY_Pos)  /*!< 0x00000020 */
#define DDRCTRL_ODTCFG_RD_ODT_DELAY_4   (0x10U << DDRCTRL_ODTCFG_RD_ODT_DELAY_Pos) /*!< 0x00000040 */
#define DDRCTRL_ODTCFG_RD_ODT_HOLD_Pos  (8U)
#define DDRCTRL_ODTCFG_RD_ODT_HOLD_Msk  (0xFU << DDRCTRL_ODTCFG_RD_ODT_HOLD_Pos)   /*!< 0x00000F00 */
#define DDRCTRL_ODTCFG_RD_ODT_HOLD      DDRCTRL_ODTCFG_RD_ODT_HOLD_Msk             /*!< DFI PHY clock cycles to hold ODT for a read command. The minimum supported value is 2. */
#define DDRCTRL_ODTCFG_RD_ODT_HOLD_0    (0x1U << DDRCTRL_ODTCFG_RD_ODT_HOLD_Pos)   /*!< 0x00000100 */
#define DDRCTRL_ODTCFG_RD_ODT_HOLD_1    (0x2U << DDRCTRL_ODTCFG_RD_ODT_HOLD_Pos)   /*!< 0x00000200 */
#define DDRCTRL_ODTCFG_RD_ODT_HOLD_2    (0x4U << DDRCTRL_ODTCFG_RD_ODT_HOLD_Pos)   /*!< 0x00000400 */
#define DDRCTRL_ODTCFG_RD_ODT_HOLD_3    (0x8U << DDRCTRL_ODTCFG_RD_ODT_HOLD_Pos)   /*!< 0x00000800 */
#define DDRCTRL_ODTCFG_WR_ODT_DELAY_Pos (16U)
#define DDRCTRL_ODTCFG_WR_ODT_DELAY_Msk (0x1FU << DDRCTRL_ODTCFG_WR_ODT_DELAY_Pos) /*!< 0x001F0000 */
#define DDRCTRL_ODTCFG_WR_ODT_DELAY     DDRCTRL_ODTCFG_WR_ODT_DELAY_Msk            /*!< The delay, in DFI PHY clock cycles, from issuing a write command to setting ODT values associated with that command. ODT setting must remain constant for the entire time that DQS is driven by the DDRCTRL. */
#define DDRCTRL_ODTCFG_WR_ODT_DELAY_0   (0x1U << DDRCTRL_ODTCFG_WR_ODT_DELAY_Pos)  /*!< 0x00010000 */
#define DDRCTRL_ODTCFG_WR_ODT_DELAY_1   (0x2U << DDRCTRL_ODTCFG_WR_ODT_DELAY_Pos)  /*!< 0x00020000 */
#define DDRCTRL_ODTCFG_WR_ODT_DELAY_2   (0x4U << DDRCTRL_ODTCFG_WR_ODT_DELAY_Pos)  /*!< 0x00040000 */
#define DDRCTRL_ODTCFG_WR_ODT_DELAY_3   (0x8U << DDRCTRL_ODTCFG_WR_ODT_DELAY_Pos)  /*!< 0x00080000 */
#define DDRCTRL_ODTCFG_WR_ODT_DELAY_4   (0x10U << DDRCTRL_ODTCFG_WR_ODT_DELAY_Pos) /*!< 0x00100000 */
#define DDRCTRL_ODTCFG_WR_ODT_HOLD_Pos  (24U)
#define DDRCTRL_ODTCFG_WR_ODT_HOLD_Msk  (0xFU << DDRCTRL_ODTCFG_WR_ODT_HOLD_Pos)   /*!< 0x0F000000 */
#define DDRCTRL_ODTCFG_WR_ODT_HOLD      DDRCTRL_ODTCFG_WR_ODT_HOLD_Msk             /*!< DFI PHY clock cycles to hold ODT for a write command. The minimum supported value is 2. */
#define DDRCTRL_ODTCFG_WR_ODT_HOLD_0    (0x1U << DDRCTRL_ODTCFG_WR_ODT_HOLD_Pos)   /*!< 0x01000000 */
#define DDRCTRL_ODTCFG_WR_ODT_HOLD_1    (0x2U << DDRCTRL_ODTCFG_WR_ODT_HOLD_Pos)   /*!< 0x02000000 */
#define DDRCTRL_ODTCFG_WR_ODT_HOLD_2    (0x4U << DDRCTRL_ODTCFG_WR_ODT_HOLD_Pos)   /*!< 0x04000000 */
#define DDRCTRL_ODTCFG_WR_ODT_HOLD_3    (0x8U << DDRCTRL_ODTCFG_WR_ODT_HOLD_Pos)   /*!< 0x08000000 */

/****************  Bit definition for DDRCTRL_ODTMAP register  ****************/
#define DDRCTRL_ODTMAP_RANK0_WR_ODT_Pos (0U)
#define DDRCTRL_ODTMAP_RANK0_WR_ODT_Msk (0x1U << DDRCTRL_ODTMAP_RANK0_WR_ODT_Pos) /*!< 0x00000001 */
#define DDRCTRL_ODTMAP_RANK0_WR_ODT     DDRCTRL_ODTMAP_RANK0_WR_ODT_Msk           /*!< Indicates which remote ODTs must be turned on during a write to rank 0. */
#define DDRCTRL_ODTMAP_RANK0_RD_ODT_Pos (4U)
#define DDRCTRL_ODTMAP_RANK0_RD_ODT_Msk (0x1U << DDRCTRL_ODTMAP_RANK0_RD_ODT_Pos) /*!< 0x00000010 */
#define DDRCTRL_ODTMAP_RANK0_RD_ODT     DDRCTRL_ODTMAP_RANK0_RD_ODT_Msk           /*!< Indicates which remote ODTs must be turned on during a read from rank 0. */

