ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157cxx_ca7.h
/****************  Bit definition for DDRPHYC_DXCCR register  *****************/
#define DDRPHYC_DXCCR_DXODT_Pos   (0U)
#define DDRPHYC_DXCCR_DXODT_Msk   (0x1U << DDRPHYC_DXCCR_DXODT_Pos)   /*!< 0x00000001 */
#define DDRPHYC_DXCCR_DXODT       DDRPHYC_DXCCR_DXODT_Msk             /*!< Data on die termination */
#define DDRPHYC_DXCCR_DXIOM_Pos   (1U)
#define DDRPHYC_DXCCR_DXIOM_Msk   (0x1U << DDRPHYC_DXCCR_DXIOM_Pos)   /*!< 0x00000002 */
#define DDRPHYC_DXCCR_DXIOM       DDRPHYC_DXCCR_DXIOM_Msk             /*!< Data I/O mode */
#define DDRPHYC_DXCCR_DXPDD_Pos   (2U)
#define DDRPHYC_DXCCR_DXPDD_Msk   (0x1U << DDRPHYC_DXCCR_DXPDD_Pos)   /*!< 0x00000004 */
#define DDRPHYC_DXCCR_DXPDD       DDRPHYC_DXCCR_DXPDD_Msk             /*!< Data power down driver */
#define DDRPHYC_DXCCR_DXPDR_Pos   (3U)
#define DDRPHYC_DXCCR_DXPDR_Msk   (0x1U << DDRPHYC_DXCCR_DXPDR_Pos)   /*!< 0x00000008 */
#define DDRPHYC_DXCCR_DXPDR       DDRPHYC_DXCCR_DXPDR_Msk             /*!< Data power down receiver */
#define DDRPHYC_DXCCR_DQSRES_Pos  (4U)
#define DDRPHYC_DXCCR_DQSRES_Msk  (0xFU << DDRPHYC_DXCCR_DQSRES_Pos)  /*!< 0x000000F0 */
#define DDRPHYC_DXCCR_DQSRES      DDRPHYC_DXCCR_DQSRES_Msk            /*!< DQS resistor */
#define DDRPHYC_DXCCR_DQSRES_0    (0x1U << DDRPHYC_DXCCR_DQSRES_Pos)  /*!< 0x00000010 */
#define DDRPHYC_DXCCR_DQSRES_1    (0x2U << DDRPHYC_DXCCR_DQSRES_Pos)  /*!< 0x00000020 */
#define DDRPHYC_DXCCR_DQSRES_2    (0x4U << DDRPHYC_DXCCR_DQSRES_Pos)  /*!< 0x00000040 */
#define DDRPHYC_DXCCR_DQSRES_3    (0x8U << DDRPHYC_DXCCR_DQSRES_Pos)  /*!< 0x00000080 */
#define DDRPHYC_DXCCR_DQSNRES_Pos (8U)
#define DDRPHYC_DXCCR_DQSNRES_Msk (0xFU << DDRPHYC_DXCCR_DQSNRES_Pos) /*!< 0x00000F00 */
#define DDRPHYC_DXCCR_DQSNRES     DDRPHYC_DXCCR_DQSNRES_Msk           /*!< DQS# resistor */
#define DDRPHYC_DXCCR_DQSNRES_0   (0x1U << DDRPHYC_DXCCR_DQSNRES_Pos) /*!< 0x00000100 */
#define DDRPHYC_DXCCR_DQSNRES_1   (0x2U << DDRPHYC_DXCCR_DQSNRES_Pos) /*!< 0x00000200 */
#define DDRPHYC_DXCCR_DQSNRES_2   (0x4U << DDRPHYC_DXCCR_DQSNRES_Pos) /*!< 0x00000400 */
#define DDRPHYC_DXCCR_DQSNRES_3   (0x8U << DDRPHYC_DXCCR_DQSNRES_Pos) /*!< 0x00000800 */
#define DDRPHYC_DXCCR_DQSNRST_Pos (14U)
#define DDRPHYC_DXCCR_DQSNRST_Msk (0x1U << DDRPHYC_DXCCR_DQSNRST_Pos) /*!< 0x00004000 */
#define DDRPHYC_DXCCR_DQSNRST     DDRPHYC_DXCCR_DQSNRST_Msk           /*!< DQS reset */
#define DDRPHYC_DXCCR_RVSEL_Pos   (15U)
#define DDRPHYC_DXCCR_RVSEL_Msk   (0x1U << DDRPHYC_DXCCR_RVSEL_Pos)   /*!< 0x00008000 */
#define DDRPHYC_DXCCR_RVSEL       DDRPHYC_DXCCR_RVSEL_Msk             /*!< ITMD read valid select */
#define DDRPHYC_DXCCR_AWDT_Pos    (16U)
#define DDRPHYC_DXCCR_AWDT_Msk    (0x1U << DDRPHYC_DXCCR_AWDT_Pos)    /*!< 0x00010000 */
#define DDRPHYC_DXCCR_AWDT        DDRPHYC_DXCCR_AWDT_Msk              /*!< Active window data train */

/****************  Bit definition for DDRPHYC_DSGCR register  *****************/
#define DDRPHYC_DSGCR_PUREN_Pos   (0U)
#define DDRPHYC_DSGCR_PUREN_Msk   (0x1U << DDRPHYC_DSGCR_PUREN_Pos)   /*!< 0x00000001 */
#define DDRPHYC_DSGCR_PUREN       DDRPHYC_DSGCR_PUREN_Msk             /*!< PHY update request enable */
#define DDRPHYC_DSGCR_BDISEN_Pos  (1U)
#define DDRPHYC_DSGCR_BDISEN_Msk  (0x1U << DDRPHYC_DSGCR_BDISEN_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DSGCR_BDISEN      DDRPHYC_DSGCR_BDISEN_Msk            /*!< Byte disable enable */
#define DDRPHYC_DSGCR_ZUEN_Pos    (2U)
#define DDRPHYC_DSGCR_ZUEN_Msk    (0x1U << DDRPHYC_DSGCR_ZUEN_Pos)    /*!< 0x00000004 */
#define DDRPHYC_DSGCR_ZUEN        DDRPHYC_DSGCR_ZUEN_Msk              /*!< zcal on DFI update request */
#define DDRPHYC_DSGCR_LPIOPD_Pos  (3U)
#define DDRPHYC_DSGCR_LPIOPD_Msk  (0x1U << DDRPHYC_DSGCR_LPIOPD_Pos)  /*!< 0x00000008 */
#define DDRPHYC_DSGCR_LPIOPD      DDRPHYC_DSGCR_LPIOPD_Msk            /*!< Low power I/O power down */
#define DDRPHYC_DSGCR_LPDLLPD_Pos (4U)
#define DDRPHYC_DSGCR_LPDLLPD_Msk (0x1U << DDRPHYC_DSGCR_LPDLLPD_Pos) /*!< 0x00000010 */
#define DDRPHYC_DSGCR_LPDLLPD     DDRPHYC_DSGCR_LPDLLPD_Msk           /*!< Low power DLL power down */
#define DDRPHYC_DSGCR_DQSGX_Pos   (5U)
#define DDRPHYC_DSGCR_DQSGX_Msk   (0x7U << DDRPHYC_DSGCR_DQSGX_Pos)   /*!< 0x000000E0 */
#define DDRPHYC_DSGCR_DQSGX       DDRPHYC_DSGCR_DQSGX_Msk             /*!< DQS gate extension */
#define DDRPHYC_DSGCR_DQSGX_0     (0x1U << DDRPHYC_DSGCR_DQSGX_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DSGCR_DQSGX_1     (0x2U << DDRPHYC_DSGCR_DQSGX_Pos)   /*!< 0x00000040 */
#define DDRPHYC_DSGCR_DQSGX_2     (0x4U << DDRPHYC_DSGCR_DQSGX_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DSGCR_DQSGE_Pos   (8U)
#define DDRPHYC_DSGCR_DQSGE_Msk   (0x7U << DDRPHYC_DSGCR_DQSGE_Pos)   /*!< 0x00000700 */
#define DDRPHYC_DSGCR_DQSGE       DDRPHYC_DSGCR_DQSGE_Msk             /*!< DQS gate early */
#define DDRPHYC_DSGCR_DQSGE_0     (0x1U << DDRPHYC_DSGCR_DQSGE_Pos)   /*!< 0x00000100 */
#define DDRPHYC_DSGCR_DQSGE_1     (0x2U << DDRPHYC_DSGCR_DQSGE_Pos)   /*!< 0x00000200 */
#define DDRPHYC_DSGCR_DQSGE_2     (0x4U << DDRPHYC_DSGCR_DQSGE_Pos)   /*!< 0x00000400 */
#define DDRPHYC_DSGCR_NOBUB_Pos   (11U)
#define DDRPHYC_DSGCR_NOBUB_Msk   (0x1U << DDRPHYC_DSGCR_NOBUB_Pos)   /*!< 0x00000800 */
#define DDRPHYC_DSGCR_NOBUB       DDRPHYC_DSGCR_NOBUB_Msk             /*!< No bubble */
#define DDRPHYC_DSGCR_FXDLAT_Pos  (12U)
#define DDRPHYC_DSGCR_FXDLAT_Msk  (0x1U << DDRPHYC_DSGCR_FXDLAT_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DSGCR_FXDLAT      DDRPHYC_DSGCR_FXDLAT_Msk            /*!< Fixed latency */
#define DDRPHYC_DSGCR_CKEPDD_Pos  (16U)
#define DDRPHYC_DSGCR_CKEPDD_Msk  (0x1U << DDRPHYC_DSGCR_CKEPDD_Pos)  /*!< 0x00010000 */
#define DDRPHYC_DSGCR_CKEPDD      DDRPHYC_DSGCR_CKEPDD_Msk            /*!< CKE power down driver */
#define DDRPHYC_DSGCR_ODTPDD_Pos  (20U)
#define DDRPHYC_DSGCR_ODTPDD_Msk  (0x1U << DDRPHYC_DSGCR_ODTPDD_Pos)  /*!< 0x00100000 */
#define DDRPHYC_DSGCR_ODTPDD      DDRPHYC_DSGCR_ODTPDD_Msk            /*!< ODT power down driver */
#define DDRPHYC_DSGCR_NL2PD_Pos   (24U)
#define DDRPHYC_DSGCR_NL2PD_Msk   (0x1U << DDRPHYC_DSGCR_NL2PD_Pos)   /*!< 0x01000000 */
#define DDRPHYC_DSGCR_NL2PD       DDRPHYC_DSGCR_NL2PD_Msk             /*!< Non LPDDR2 power down */
#define DDRPHYC_DSGCR_NL2OE_Pos   (25U)
#define DDRPHYC_DSGCR_NL2OE_Msk   (0x1U << DDRPHYC_DSGCR_NL2OE_Pos)   /*!< 0x02000000 */
#define DDRPHYC_DSGCR_NL2OE       DDRPHYC_DSGCR_NL2OE_Msk             /*!< Non LPDDR2 output enable */
#define DDRPHYC_DSGCR_TPDPD_Pos   (26U)
#define DDRPHYC_DSGCR_TPDPD_Msk   (0x1U << DDRPHYC_DSGCR_TPDPD_Pos)   /*!< 0x04000000 */
#define DDRPHYC_DSGCR_TPDPD       DDRPHYC_DSGCR_TPDPD_Msk             /*!< TPD power down driver (N/A LPDDR only) */
#define DDRPHYC_DSGCR_TPDOE_Pos   (27U)
#define DDRPHYC_DSGCR_TPDOE_Msk   (0x1U << DDRPHYC_DSGCR_TPDOE_Pos)   /*!< 0x08000000 */
#define DDRPHYC_DSGCR_TPDOE       DDRPHYC_DSGCR_TPDOE_Msk             /*!< TPD output enable (N/A LPDDR only) */
#define DDRPHYC_DSGCR_CKOE_Pos    (28U)
#define DDRPHYC_DSGCR_CKOE_Msk    (0x1U << DDRPHYC_DSGCR_CKOE_Pos)    /*!< 0x10000000 */
#define DDRPHYC_DSGCR_CKOE        DDRPHYC_DSGCR_CKOE_Msk              /*!< CK output enable */
#define DDRPHYC_DSGCR_ODTOE_Pos   (29U)
#define DDRPHYC_DSGCR_ODTOE_Msk   (0x1U << DDRPHYC_DSGCR_ODTOE_Pos)   /*!< 0x20000000 */
#define DDRPHYC_DSGCR_ODTOE       DDRPHYC_DSGCR_ODTOE_Msk             /*!< ODT output enable */
#define DDRPHYC_DSGCR_RSTOE_Pos   (30U)
#define DDRPHYC_DSGCR_RSTOE_Msk   (0x1U << DDRPHYC_DSGCR_RSTOE_Pos)   /*!< 0x40000000 */
#define DDRPHYC_DSGCR_RSTOE       DDRPHYC_DSGCR_RSTOE_Msk             /*!< RST output enable */
#define DDRPHYC_DSGCR_CKEOE_Pos   (31U)
#define DDRPHYC_DSGCR_CKEOE_Msk   (0x1U << DDRPHYC_DSGCR_CKEOE_Pos)   /*!< 0x80000000 */
#define DDRPHYC_DSGCR_CKEOE       DDRPHYC_DSGCR_CKEOE_Msk             /*!< CKE output enable */

