ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157cxx_ca7.h
/**************  Bit definition for RCC_TZAHB6RSTSETR register  ***************/
#define RCC_TZAHB6RSTSETR_MDMARST_Pos             (0U)
#define RCC_TZAHB6RSTSETR_MDMARST_Msk             (0x1U << RCC_TZAHB6RSTSETR_MDMARST_Pos)            /*!< 0x00000001 */
#define RCC_TZAHB6RSTSETR_MDMARST                 RCC_TZAHB6RSTSETR_MDMARST_Msk                      /*!< MDMA block reset */

/**************  Bit definition for RCC_TZAHB6RSTCLRR register  ***************/
#define RCC_TZAHB6RSTCLRR_MDMARST_Pos             (0U)
#define RCC_TZAHB6RSTCLRR_MDMARST_Msk             (0x1U << RCC_TZAHB6RSTCLRR_MDMARST_Pos)            /*!< 0x00000001 */
#define RCC_TZAHB6RSTCLRR_MDMARST                 RCC_TZAHB6RSTCLRR_MDMARST_Msk                      /*!< MDMA block reset */

/**************  Bit definition for RCC_MP_APB4ENSETR register  ***************/
#define RCC_MP_APB4ENSETR_LTDCEN_Pos              (0U)
#define RCC_MP_APB4ENSETR_LTDCEN_Msk              (0x1U << RCC_MP_APB4ENSETR_LTDCEN_Pos)             /*!< 0x00000001 */
#define RCC_MP_APB4ENSETR_LTDCEN                  RCC_MP_APB4ENSETR_LTDCEN_Msk                       /*!< LTDC peripheral clocks enable */
#define RCC_MP_APB4ENSETR_DSIEN_Pos               (4U)
#define RCC_MP_APB4ENSETR_DSIEN_Msk               (0x1U << RCC_MP_APB4ENSETR_DSIEN_Pos)              /*!< 0x00000010 */
#define RCC_MP_APB4ENSETR_DSIEN                   RCC_MP_APB4ENSETR_DSIEN_Msk                        /*!< DSI peripheral clocks enable */
#define RCC_MP_APB4ENSETR_DDRPERFMEN_Pos          (8U)
#define RCC_MP_APB4ENSETR_DDRPERFMEN_Msk          (0x1U << RCC_MP_APB4ENSETR_DDRPERFMEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB4ENSETR_DDRPERFMEN              RCC_MP_APB4ENSETR_DDRPERFMEN_Msk                   /*!< DDRPERFM APB clock enable */
#define RCC_MP_APB4ENSETR_IWDG2APBEN_Pos          (15U)
#define RCC_MP_APB4ENSETR_IWDG2APBEN_Msk          (0x1U << RCC_MP_APB4ENSETR_IWDG2APBEN_Pos)         /*!< 0x00008000 */
#define RCC_MP_APB4ENSETR_IWDG2APBEN              RCC_MP_APB4ENSETR_IWDG2APBEN_Msk                   /*!< IWDG2 APB clock enable */
#define RCC_MP_APB4ENSETR_USBPHYEN_Pos            (16U)
#define RCC_MP_APB4ENSETR_USBPHYEN_Msk            (0x1U << RCC_MP_APB4ENSETR_USBPHYEN_Pos)           /*!< 0x00010000 */
#define RCC_MP_APB4ENSETR_USBPHYEN                RCC_MP_APB4ENSETR_USBPHYEN_Msk                     /*!< USBPHYC peripheral clocks enable */
#define RCC_MP_APB4ENSETR_STGENROEN_Pos           (20U)
#define RCC_MP_APB4ENSETR_STGENROEN_Msk           (0x1U << RCC_MP_APB4ENSETR_STGENROEN_Pos)          /*!< 0x00100000 */
#define RCC_MP_APB4ENSETR_STGENROEN               RCC_MP_APB4ENSETR_STGENROEN_Msk                    /*!< STGEN Read-Only interface peripheral clocks enable */

/**************  Bit definition for RCC_MP_APB4ENCLRR register  ***************/
#define RCC_MP_APB4ENCLRR_LTDCEN_Pos              (0U)
#define RCC_MP_APB4ENCLRR_LTDCEN_Msk              (0x1U << RCC_MP_APB4ENCLRR_LTDCEN_Pos)             /*!< 0x00000001 */
#define RCC_MP_APB4ENCLRR_LTDCEN                  RCC_MP_APB4ENCLRR_LTDCEN_Msk                       /*!< LTDC peripheral clocks disable */
#define RCC_MP_APB4ENCLRR_DSIEN_Pos               (4U)
#define RCC_MP_APB4ENCLRR_DSIEN_Msk               (0x1U << RCC_MP_APB4ENCLRR_DSIEN_Pos)              /*!< 0x00000010 */
#define RCC_MP_APB4ENCLRR_DSIEN                   RCC_MP_APB4ENCLRR_DSIEN_Msk                        /*!< DSI peripheral clocks disable */
#define RCC_MP_APB4ENCLRR_DDRPERFMEN_Pos          (8U)
#define RCC_MP_APB4ENCLRR_DDRPERFMEN_Msk          (0x1U << RCC_MP_APB4ENCLRR_DDRPERFMEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB4ENCLRR_DDRPERFMEN              RCC_MP_APB4ENCLRR_DDRPERFMEN_Msk                   /*!< DDRPERFM APB clock enable */
#define RCC_MP_APB4ENCLRR_IWDG2APBEN_Pos          (15U)
#define RCC_MP_APB4ENCLRR_IWDG2APBEN_Msk          (0x1U << RCC_MP_APB4ENCLRR_IWDG2APBEN_Pos)         /*!< 0x00008000 */
#define RCC_MP_APB4ENCLRR_IWDG2APBEN              RCC_MP_APB4ENCLRR_IWDG2APBEN_Msk                   /*!< IWDG2 APB clock disable */
#define RCC_MP_APB4ENCLRR_USBPHYEN_Pos            (16U)
#define RCC_MP_APB4ENCLRR_USBPHYEN_Msk            (0x1U << RCC_MP_APB4ENCLRR_USBPHYEN_Pos)           /*!< 0x00010000 */
#define RCC_MP_APB4ENCLRR_USBPHYEN                RCC_MP_APB4ENCLRR_USBPHYEN_Msk                     /*!< USBPHYC peripheral clocks disable */
#define RCC_MP_APB4ENCLRR_STGENROEN_Pos           (20U)
#define RCC_MP_APB4ENCLRR_STGENROEN_Msk           (0x1U << RCC_MP_APB4ENCLRR_STGENROEN_Pos)          /*!< 0x00100000 */
#define RCC_MP_APB4ENCLRR_STGENROEN               RCC_MP_APB4ENCLRR_STGENROEN_Msk                    /*!< STGEN Read-Only interface peripheral clocks disable */

/**************  Bit definition for RCC_MP_APB5ENSETR register  ***************/
#define RCC_MP_APB5ENSETR_SPI6EN_Pos              (0U)
#define RCC_MP_APB5ENSETR_SPI6EN_Msk              (0x1U << RCC_MP_APB5ENSETR_SPI6EN_Pos)             /*!< 0x00000001 */
#define RCC_MP_APB5ENSETR_SPI6EN                  RCC_MP_APB5ENSETR_SPI6EN_Msk                       /*!< SPI6 peripheral clocks enable */
#define RCC_MP_APB5ENSETR_I2C4EN_Pos              (2U)
#define RCC_MP_APB5ENSETR_I2C4EN_Msk              (0x1U << RCC_MP_APB5ENSETR_I2C4EN_Pos)             /*!< 0x00000004 */
#define RCC_MP_APB5ENSETR_I2C4EN                  RCC_MP_APB5ENSETR_I2C4EN_Msk                       /*!< I2C4 peripheral clocks enable */
#define RCC_MP_APB5ENSETR_I2C6EN_Pos              (3U)
#define RCC_MP_APB5ENSETR_I2C6EN_Msk              (0x1U << RCC_MP_APB5ENSETR_I2C6EN_Pos)             /*!< 0x00000008 */
#define RCC_MP_APB5ENSETR_I2C6EN                  RCC_MP_APB5ENSETR_I2C6EN_Msk                       /*!< I2C6 peripheral clocks enable */
#define RCC_MP_APB5ENSETR_USART1EN_Pos            (4U)
#define RCC_MP_APB5ENSETR_USART1EN_Msk            (0x1U << RCC_MP_APB5ENSETR_USART1EN_Pos)           /*!< 0x00000010 */
#define RCC_MP_APB5ENSETR_USART1EN                RCC_MP_APB5ENSETR_USART1EN_Msk                     /*!< USART1 peripheral clocks enable */
#define RCC_MP_APB5ENSETR_RTCAPBEN_Pos            (8U)
#define RCC_MP_APB5ENSETR_RTCAPBEN_Msk            (0x1U << RCC_MP_APB5ENSETR_RTCAPBEN_Pos)           /*!< 0x00000100 */
#define RCC_MP_APB5ENSETR_RTCAPBEN                RCC_MP_APB5ENSETR_RTCAPBEN_Msk                     /*!< RTC APB clock enable */
#define RCC_MP_APB5ENSETR_TZC1EN_Pos              (11U)
#define RCC_MP_APB5ENSETR_TZC1EN_Msk              (0x1U << RCC_MP_APB5ENSETR_TZC1EN_Pos)             /*!< 0x00000800 */
#define RCC_MP_APB5ENSETR_TZC1EN                  RCC_MP_APB5ENSETR_TZC1EN_Msk                       /*!< TZC AXI port 1 clocks enable */
#define RCC_MP_APB5ENSETR_TZC2EN_Pos              (12U)
#define RCC_MP_APB5ENSETR_TZC2EN_Msk              (0x1U << RCC_MP_APB5ENSETR_TZC2EN_Pos)             /*!< 0x00001000 */
#define RCC_MP_APB5ENSETR_TZC2EN                  RCC_MP_APB5ENSETR_TZC2EN_Msk                       /*!< TZC AXI port 2 clocks enable */
#define RCC_MP_APB5ENSETR_TZPCEN_Pos              (13U)
#define RCC_MP_APB5ENSETR_TZPCEN_Msk              (0x1U << RCC_MP_APB5ENSETR_TZPCEN_Pos)             /*!< 0x00002000 */
#define RCC_MP_APB5ENSETR_TZPCEN                  RCC_MP_APB5ENSETR_TZPCEN_Msk                       /*!< TZPC peripheral clocks enable */
#define RCC_MP_APB5ENSETR_IWDG1APBEN_Pos          (15U)
#define RCC_MP_APB5ENSETR_IWDG1APBEN_Msk          (0x1U << RCC_MP_APB5ENSETR_IWDG1APBEN_Pos)         /*!< 0x00008000 */
#define RCC_MP_APB5ENSETR_IWDG1APBEN              RCC_MP_APB5ENSETR_IWDG1APBEN_Msk                   /*!< IWDG1 APB clock enable */
#define RCC_MP_APB5ENSETR_BSECEN_Pos              (16U)
#define RCC_MP_APB5ENSETR_BSECEN_Msk              (0x1U << RCC_MP_APB5ENSETR_BSECEN_Pos)             /*!< 0x00010000 */
#define RCC_MP_APB5ENSETR_BSECEN                  RCC_MP_APB5ENSETR_BSECEN_Msk                       /*!< BSEC peripheral clocks enable */
#define RCC_MP_APB5ENSETR_STGENEN_Pos             (20U)
#define RCC_MP_APB5ENSETR_STGENEN_Msk             (0x1U << RCC_MP_APB5ENSETR_STGENEN_Pos)            /*!< 0x00100000 */
#define RCC_MP_APB5ENSETR_STGENEN                 RCC_MP_APB5ENSETR_STGENEN_Msk                      /*!< STGEN Controller part, peripheral clocks enable */

/**************  Bit definition for RCC_MP_APB5ENCLRR register  ***************/
#define RCC_MP_APB5ENCLRR_SPI6EN_Pos              (0U)
#define RCC_MP_APB5ENCLRR_SPI6EN_Msk              (0x1U << RCC_MP_APB5ENCLRR_SPI6EN_Pos)             /*!< 0x00000001 */
#define RCC_MP_APB5ENCLRR_SPI6EN                  RCC_MP_APB5ENCLRR_SPI6EN_Msk                       /*!< SPI6 peripheral clocks disable */
#define RCC_MP_APB5ENCLRR_I2C4EN_Pos              (2U)
#define RCC_MP_APB5ENCLRR_I2C4EN_Msk              (0x1U << RCC_MP_APB5ENCLRR_I2C4EN_Pos)             /*!< 0x00000004 */
#define RCC_MP_APB5ENCLRR_I2C4EN                  RCC_MP_APB5ENCLRR_I2C4EN_Msk                       /*!< I2C4 peripheral clocks disable */
#define RCC_MP_APB5ENCLRR_I2C6EN_Pos              (3U)
#define RCC_MP_APB5ENCLRR_I2C6EN_Msk              (0x1U << RCC_MP_APB5ENCLRR_I2C6EN_Pos)             /*!< 0x00000008 */
#define RCC_MP_APB5ENCLRR_I2C6EN                  RCC_MP_APB5ENCLRR_I2C6EN_Msk                       /*!< I2C6 peripheral clocks disable */
#define RCC_MP_APB5ENCLRR_USART1EN_Pos            (4U)
#define RCC_MP_APB5ENCLRR_USART1EN_Msk            (0x1U << RCC_MP_APB5ENCLRR_USART1EN_Pos)           /*!< 0x00000010 */
#define RCC_MP_APB5ENCLRR_USART1EN                RCC_MP_APB5ENCLRR_USART1EN_Msk                     /*!< USART1 peripheral clocks disable */
#define RCC_MP_APB5ENCLRR_RTCAPBEN_Pos            (8U)
#define RCC_MP_APB5ENCLRR_RTCAPBEN_Msk            (0x1U << RCC_MP_APB5ENCLRR_RTCAPBEN_Pos)           /*!< 0x00000100 */
#define RCC_MP_APB5ENCLRR_RTCAPBEN                RCC_MP_APB5ENCLRR_RTCAPBEN_Msk                     /*!< RTC APB clock disable */
#define RCC_MP_APB5ENCLRR_TZC1EN_Pos              (11U)
#define RCC_MP_APB5ENCLRR_TZC1EN_Msk              (0x1U << RCC_MP_APB5ENCLRR_TZC1EN_Pos)             /*!< 0x00000800 */
#define RCC_MP_APB5ENCLRR_TZC1EN                  RCC_MP_APB5ENCLRR_TZC1EN_Msk                       /*!< TZC AXI port 1 clocks disable */
#define RCC_MP_APB5ENCLRR_TZC2EN_Pos              (12U)
#define RCC_MP_APB5ENCLRR_TZC2EN_Msk              (0x1U << RCC_MP_APB5ENCLRR_TZC2EN_Pos)             /*!< 0x00001000 */
#define RCC_MP_APB5ENCLRR_TZC2EN                  RCC_MP_APB5ENCLRR_TZC2EN_Msk                       /*!< TZC AXI port 2 clocks disable */
#define RCC_MP_APB5ENCLRR_TZPCEN_Pos              (13U)
#define RCC_MP_APB5ENCLRR_TZPCEN_Msk              (0x1U << RCC_MP_APB5ENCLRR_TZPCEN_Pos)             /*!< 0x00002000 */
#define RCC_MP_APB5ENCLRR_TZPCEN                  RCC_MP_APB5ENCLRR_TZPCEN_Msk                       /*!< TZPC peripheral clocks disable */
#define RCC_MP_APB5ENCLRR_IWDG1APBEN_Pos          (15U)
#define RCC_MP_APB5ENCLRR_IWDG1APBEN_Msk          (0x1U << RCC_MP_APB5ENCLRR_IWDG1APBEN_Pos)         /*!< 0x00008000 */
#define RCC_MP_APB5ENCLRR_IWDG1APBEN              RCC_MP_APB5ENCLRR_IWDG1APBEN_Msk                   /*!< IWDG1 APB clock disable */
#define RCC_MP_APB5ENCLRR_BSECEN_Pos              (16U)
#define RCC_MP_APB5ENCLRR_BSECEN_Msk              (0x1U << RCC_MP_APB5ENCLRR_BSECEN_Pos)             /*!< 0x00010000 */
#define RCC_MP_APB5ENCLRR_BSECEN                  RCC_MP_APB5ENCLRR_BSECEN_Msk                       /*!< BSEC peripheral clocks disable */
#define RCC_MP_APB5ENCLRR_STGENEN_Pos             (20U)
#define RCC_MP_APB5ENCLRR_STGENEN_Msk             (0x1U << RCC_MP_APB5ENCLRR_STGENEN_Pos)            /*!< 0x00100000 */
#define RCC_MP_APB5ENCLRR_STGENEN                 RCC_MP_APB5ENCLRR_STGENEN_Msk                      /*!< STGEN Controller part, peripheral clocks disable */

